## Terraform Plan Analysis

✅ **Changes detected** affecting 3 resources:

### Changed Resources
```
local_file.example
null_resource.example
random_string.example
```

### Outputs
- **diff-bool**: `true`
- **diff-count**: `3`
- **diff-resources**: `["local_file.example","null_resource.example","random_string.example"]`
- **Plan Summary**: 0 to add, 0 to change, 0 to destroy

### Raw Terraform Plan Output
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.example will be created
  + resource "local_file" "example" {
      + content              = "Hello, Terraform!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./hello.txt"
      + id                   = (known after apply)
    }

  # null_resource.example will be created
  + resource "null_resource" "example" {
      + id       = (known after apply)
      + triggers = {
          + "timestamp" = (known after apply)
        }
    }


  # random_string.example will be created
  + resource "random_string" "example" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + null_resource_id    = (known after apply)
  + random_string_value = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

---
*Generated by Terraform Plan Parser*